Repository: sergserg2/script.light.imdb.ratings.update
Catalog: resources/language/*/strings.po
Languages: italian

# Addon Summary
source: Light IMDb Ratings Update is a Kodi add-on that keeps updated the IMDb ratings for your Movies and TV Shows.
italian: Light IMDb Ratings Update è un add-on di Kodi che mantiene aggiornate le valutazioni IMDb dei tuoi Film e Serie TV.

# Addon Description
source: Light IMDb Ratings Update runs as a Kodi service to update the ratings, votes and IMDb Top 250 for Movies as well as the ratings and votes for TV Shows (including Episodes) by scraping the data from the IMDb site. The update can be run manually or scheduled once a week and it will run as soon as possible after a scheduled start is missed. Light IMDb Ratings Update requires the presence of the IMDb IDs for the Movies, TV Shows and Episodes you want to be updated. Light IMDb Ratings Update is compatible with Kodi 17/18 and runs on every platform. Please check the add-on thread in the Kodi forum for more details.
italian: Light IMDb Ratings Update viene eseguito come un servizio di Kodi per aggiornare le valutazioni, i voti e la Top 250 IMDb per i Film così come le valutazioni ed i voti per le Serie TV (inclusi gli Episodi) ottenendo i dati dal sito IMDb. L'aggiornamento può essere eseguito manualmente o pianificato una volta alla settimana e sarà avviato appena possibile se un avvio pianificato non viene eseguito. Light IMDb Ratings Update richiede la presenza degli IMDb ID per i Film, le Serie TV e gli Episodi che si vogliono aggiornare. Light IMDb Ratings Update è compatibile con Kodi 17/18 e gira su ogni piattaforma. Per ulteriori dettagli si veda il thread dell'add-on nel forum di Kodi.

# #32200
source: Service successfully started
italian: Servizio avviato con successo

# #32251
source: The ratings update is already running, please wait...
italian: L'aggiornamento delle valutazioni è già in corso, attendere prego...

# #32252
source: Update rating
italian: Aggiorna valutazione

# #32253
source: Would you like to update the ratings also for all the Episodes?
italian: Desideri aggiornare le valutazioni anche per tutti gli Episodi?

# #32255
source: Ratings update for Movies started
italian: Aggiornamento delle valutazioni dei Film avviato

# #32256
source: Ratings update for TV Shows started
italian: Aggiornamento delle valutazioni delle Serie TV avviato

# #32258
source: Ratings update for Movies finished
italian: Aggiornamento delle valutazioni dei Film terminato

# #32259
source: Ratings update for TV Shows finished
italian: Aggiornamento delle valutazioni delle Serie TV terminato

# #32260
source: Updating rating
italian: Aggiornamento valutazione

# #32261
source: Updating ratings for Movies
italian: Aggiornamento delle valutazioni dei Film

# #32262
source: Updating ratings for TV Shows
italian: Aggiornamento delle valutazioni delle Serie TV

# #32499
source: Current data: rating: %s, votes: %s, top250: %s
italian: Dati attuali: rating: %s, votes: %s, top250: %s

# #32500
source: "%s": Update finished (rating: %s, votes: %s, top250: %s)
italian: "%s": Aggiornamento terminato (rating: %s, votes: %s, top250: %s)

# #32502
source: "%s": Update finished (no update)
italian: "%s": Aggiornamento terminato (nessun aggiornamento)

# #32503
source: "%s": Update finished (impossible to update)
italian: "%s": Aggiornamento terminato (impossibile aggiornare)

# #32505
source: Error accessing IMDb site (%s)
italian: Errore di accesso al sito IMDb (%s)

# #32506
source: Scraped data: rating: %s, votes: %s, top250: %s
italian: Dati ottenuti: rating: %s, votes: %s, top250: %s

# #32507
source: "%s": Update started (IMDb ID: %s, TVDB ID: %s)
italian: "%s": Aggiornamento iniziato (IMDb ID: %s, TVDB ID: %s)

# #32508
source: Would you like to update the ratings for all the Episodes of %s?
italian: Desideri aggiornare le valutazioni di tutti gli Episodi della %s?

# #32509
source: Obtaining IMDb ID from TheTVDB site...
italian: Ottenimento IMDb ID dal sito TheTVDB...

# #32510
source: Obtain IMDb ID from TheTVDB site is disabled
italian: Ottieni IMDb ID dal sito TheTVDB è disabilitato

# #32511
source: Check TVDB ID
italian: Verificare TVDB ID

# #32655
source: Next update is scheduled the %s at %s
italian: Prossimo aggiornamento programmato per il %s alle ore %s

# #32801
source: General
italian: Generale

# #32805
source: Update Top 250
italian: Aggiorna la Top 250

# #32806
source: Movies
italian: Film

# #32807
source: Update ratings
italian: Aggiorna valutazioni

# #32808
source: Include votes
italian: Includi voti

# #32809
source: TV Shows
italian: Serie TV

# #32810
source: Update ratings
italian: Aggiorna valutazioni

# #32812
source: Scheduling options
italian: Opzioni pianificazione

# #32813
source: Day
italian: Giorno

# #32814
source: Time
italian: Ora

# #32816
source: Show notifications
italian: Mostra notifiche

# #32817
source: Show update progress
italian: Mostra avanzamento aggiornamento

# #32818
source: Include Episodes
italian: Includi Episodi

# #32819
source: Obtain IMDb ID from TheTVDB.com
italian: Ottieni IMDb ID da TheTVDB.com

# #32820
source: API Key
italian: Chiave API

# #32821
source: Scheduling
italian: Pianificazione

# #32822
source: Enable
italian: Abilita

# #32823
source: Background options
italian: Opzioni background

# #32828
source: Monday
italian: Lunedì

# #32829
source: Tuesday
italian: Martedì

# #32830
source: Wednesday
italian: Mercoledì

# #32831
source: Thursday
italian: Giovedì

# #32832
source: Friday
italian: Venerdì

# #32833
source: Saturday
italian: Sabato

# #32834
source: Sunday
italian: Domenica
